# CannotConvertInstHostToWorkPlane Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FamilyFailures..::..CannotConvertInstHostToWorkPlane Property
BuiltInFailures..::..FamilyFailures Class See Also
---
Can't convert Instance's Host to Work Plane. Try resetting Host to a Level.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotConvertInstHostToWorkPlane { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotConvertInstHostToWorkPlane As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotConvertInstHostToWorkPlane {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FamilyFailures Class
Autodesk.Revit.DB Namespace